index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-05-21 Sun 13:24 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="Subham Saha" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org5fa7f38">1. EDUCATION</a>
<ul>
<li><a href="#orge44af8a">1.1. Indian Institute of Space Science and Technology, Trivandrum, India 2016-2020</a></li>
</ul>
</li>
<li><a href="#org574b766">2. PROFESSIONAL EXPERIENCE</a>
<ul>
<li><a href="#orga8aac27">2.1. U. R. Rao Satellite Center, Indian Space Research Organization 2021-Present</a>
<ul>
<li><a href="#org227c657">2.1.1. Embedded Software Developer, Human Space Program</a></li>
<li><a href="#orged2678a">2.1.2. Project Lead for RTOS</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgdd40e0e">3. RESEARCH EXPERIENCE</a>
<ul>
<li><a href="#org126becc">3.1. Indian Institute of Science, Bangalore 2020</a></li>
<li><a href="#org5de4530">3.2. Jet Propulsion Lab, Pasadena  2019</a></li>
<li><a href="#org841b503">3.3. Indian Institute of Space Science and Technology, Trivandrum  2017-2018</a></li>
</ul>
</li>
<li><a href="#orgd35e361">4. AWARDS AND HONORS</a></li>
<li><a href="#org92b9cdf">5. PUBLICATIONS</a>
<ul>
<li><a href="#org4e4689e">5.1. Journal Articles</a></li>
<li><a href="#org2c0139a">5.2. Conference Proceedings</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org5fa7f38" class="outline-2">
<h2 id="org5fa7f38"><span class="section-number-2">1.</span> EDUCATION</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orge44af8a" class="outline-3">
<h3 id="orge44af8a"><span class="section-number-3">1.1.</span> Indian Institute of Space Science and Technology, Trivandrum, India 2016-2020</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>Bachelor of Technology, Electronics and Communication Engineering</li>
<li>CGPA: <b>9.62/10</b></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org574b766" class="outline-2">
<h2 id="org574b766"><span class="section-number-2">2.</span> PROFESSIONAL EXPERIENCE</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orga8aac27" class="outline-3">
<h3 id="orga8aac27"><span class="section-number-3">2.1.</span> U. R. Rao Satellite Center, Indian Space Research Organization 2021-Present</h3>
<div class="outline-text-3" id="text-2-1">
</div>
<div id="outline-container-org227c657" class="outline-4">
<h4 id="org227c657"><span class="section-number-4">2.1.1.</span> Embedded Software Developer, Human Space Program</h4>
<div class="outline-text-4" id="text-2-1-1">
<p>
(Ada, GDB, Python, Gnuplot, GNU Make, Git/Gitlab)
</p>

<ul class="org-ul">
<li>Implemented CCSDS space packet protocol to amplify single uplink capability <b>upto 8 times</b> in HX1750 based system.</li>
<li>Developed a telemetry system for data acquisition from diverse interfaces (e.g. analog sensor, Mil1553B etc.), uniform parameter identifier assignment, and formatting data into CCSDS compliant frame structure for 8Kbps stream.</li>
<li>Designed critical event monitoring system for failure detection, and fixed-priority command execution for recovery. Successfully <b>unit-tested</b> using <b>GNAT Debugger GDB</b> and integration-tested the failure mitigation scheme with time constraints under simulated stimuli.</li>
<li>Conceptualized a simple EEPROM based command storage system for power on initialization which <b>reduced</b> the number of uplink required to program by <b>50%</b>.</li>
<li>Established <b>version control</b>, and <b>CI/CD pipelines</b> using Gitlab for compiling and maintaining the code base.</li>
<li>Developed scripts to parse Mil1553B bus-monitor logs into annotated database to automate testing, and timing verification.</li>
</ul>
</div>
</div>

<div id="outline-container-orged2678a" class="outline-4">
<h4 id="orged2678a"><span class="section-number-4">2.1.2.</span> Project Lead for RTOS</h4>
<div class="outline-text-4" id="text-2-1-2">
<p>
(C, GDB, FreeRTOS, GNU Make, Qemu, Git/Gitlab)
</p>

<ul class="org-ul">
<li>Self-taught <b>FreeRTOS</b> kernel internals to implement <b>operating system</b> based task management to improve processor cycle utilization.</li>
<li>Established remote debug facilities in emulated (QEMU) and target environment using <b>GNU Debugger</b>.</li>
<li>Developed codebase for command reception and loopback in target environment.</li>
</ul>
</div>
</div>
</div>
</div>

<div id="outline-container-orgdd40e0e" class="outline-2">
<h2 id="orgdd40e0e"><span class="section-number-2">3.</span> RESEARCH EXPERIENCE</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org126becc" class="outline-3">
<h3 id="org126becc"><span class="section-number-3">3.1.</span> Indian Institute of Science, Bangalore 2020</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Mentor: <a href="https://www.linkedin.com/in/chandra-murthy-6a67221/">Chandra R. Murthy</a>, <a href="https://www.linkedin.com/in/vineeth-b-s-56117274/">Vineeth B. S.</a>
</p>
<ul class="org-ul">
<li>Characterized <b>average age of information</b> (AAoI) in massive machine type communication for frame-based <b>irregular repetition slotted aloha</b> (IRSA) as function of users, frame duration, and repetition distribution for two cases of transmission: <b>beginning of the frame</b> and <b>just-in-time</b>.</li>
<li>Proposed and characterized a novel <b>early packet recovery</b> method using successive interference cancellation in every slot of IRSA. The early recovery method achieves AAoI <b>54% less</b> than that of slotted ALOHA and <b>53% less</b> than CRDSA.</li>
<li>Optimized normalized channel traffic and repetition distribution to <b>minimize AAoI</b> in asymptotic scenario and formulated practical method to reduce AAoI in non-asymptotic case which performs as closely as <b>12%</b> of the asymptotic value.</li>
<li>Derived analytical expression and characterized <b>average age of incorrect information</b> for <b>remote estimation of a stochastic piecewise linear signal</b> over unreliable channel.</li>
</ul>
</div>
</div>

<div id="outline-container-org5de4530" class="outline-3">
<h3 id="org5de4530"><span class="section-number-3">3.2.</span> Jet Propulsion Lab, Pasadena  2019</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Mentor: <a href="https://www.linkedin.com/in/clayton-okino-91709a2b/">Clayton Okino</a>
</p>
<ul class="org-ul">
<li>Developed a <b>spectrum analysis suite</b> in Qt to inspect wireless environment using Universal Software Radio Peripheral, GNU Radio, and UHD C/C++ API supported through SWIG.</li>
<li>Incorporated visualization of spatial energy distribution, and location-tagging of the acquired samples.</li>
</ul>
</div>
</div>

<div id="outline-container-org841b503" class="outline-3">
<h3 id="org841b503"><span class="section-number-3">3.3.</span> Indian Institute of Space Science and Technology, Trivandrum  2017-2018</h3>
<div class="outline-text-3" id="text-3-3">
<p>
Mentor: <a href="https://www.linkedin.com/in/anoop-c-s-52b84122/">Anoop C. S.</a>
</p>
<ul class="org-ul">
<li>Designed a novel <b>microcontroller-based direct digital interface</b> circuit for <b>Giant Magneto-Resistance sensors</b> to measure magnetic field strength using discharge times of a capacitor in three different conversion modes to compensate pin resistance.</li>
<li>Carried out <b>simulation and emulation studies</b> of the scheme to find worst case <b>non-linearity of 0.33% in simulation model and 0.35% in emulation model</b>.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgd35e361" class="outline-2">
<h2 id="orgd35e361"><span class="section-number-2">4.</span> AWARDS AND HONORS</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li><b>Department of Space scholarship</b> 2016</li>
<li>Institute Gold Medal for <b>Best Academic Performer in Undergraduate</b> 2020</li>
<li><b>Ranked 31 among 45833</b> candidates in Graduate Aptitude Test (GATE) in EC 2023</li>
</ul>
</div>
</div>

<div id="outline-container-org92b9cdf" class="outline-2">
<h2 id="org92b9cdf"><span class="section-number-2">5.</span> PUBLICATIONS</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-org4e4689e" class="outline-3">
<h3 id="org4e4689e"><span class="section-number-3">5.1.</span> Journal Articles</h3>
<div class="outline-text-3" id="text-5-1">
<ol class="org-ol">
<li>S. Saha, V. B. Sukumaran and C. R. Murthy, &ldquo;On the Minimum Average Age of Information in IRSA for Grant-Free mMTC,&rdquo; in IEEE JSAC, May 2021, doi: 10.1109/JSAC.2021.3065065.</li>
<li>S. Saha, H. S. Makkar, V. B. Sukumaran and C. R. Murthy, &ldquo;On the Relationship Between Mean Absolute Error and Age of Incorrect Information in the Estimation of a Piecewise Linear Signal Over Noisy Channels,&rdquo; in IEEE Communications Letters, Nov. 2022, doi: 10.1109/LCOMM.2022.3200306.</li>
</ol>
</div>
</div>
<div id="outline-container-org2c0139a" class="outline-3">
<h3 id="org2c0139a"><span class="section-number-3">5.2.</span> Conference Proceedings</h3>
<div class="outline-text-3" id="text-5-2">
<ol class="org-ol">
<li>K. Elangovan, S. Saha and C. S. Anoop, &ldquo;A Simple Digital Interface Circuit for Giant Magneto-Resistance Sensors,&rdquo; IEEE TENCON 2019, doi: 10.1109/TENCON.2019.8929418.</li>
</ol>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Subham Saha</p>
<p class="date">Created: 2023-05-21 Sun 13:24</p>
</div>
</body>
</html>